let i = 0;
let sum = 0;

function positiveSum(number) {

	for (i; i < number.length; i++) {
		if (number[i] < 0) {
			number.splice(number[i], 0);
		} else {
			sum = sum + number[i];
		}
	}
	return sum;

}

// Для тестов

// console.log(positiveSum([1, -4, 7, 12]));
// console.log(positiveSum([-40, 14, 3, 76, 24, 77, 17, -12, 24, 38]))
console.log(positiveSum([-9, 85, 14, 16, 83, -4, -9, 88, 15, 64, 57, -20, 82, -71, 15, -84, -81, 61, 1, -48, 92, -100, -7, -46, -94, -76, 38, -80, 3, -41, -4, 75, 75, -28, 17, -14, 38, -54, -30, 80, -65, 79, 47, 88, -21, -70, -47, 64, 8, 84, 27, 47, 29, -68, 92, 6, 54, 37, -23, 8, 89, 10, -13, -61, -90, -12, 93, 96, 61, 76, 59, -26, 90, 49, 44, 35, 95, -84, -99, 19, 70, -13, 37, 17, -58, -6, -42, 47, -51, 68, 9, -18, 96, 78, -85, -55, 83, 16, -35, -19]))

// Ну а что, чем больше - тем лучше)